zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ERM.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_ERM.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_ERM
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_ERM_H_)  /* Check if memory map has not been already included */
#define S32K566_ERM_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- ERM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ERM_Peripheral_Access_Layer ERM Peripheral Access Layer
 * @{
 */

/** ERM - Register Layout Typedef */
typedef struct ERM_Struct {
  __IO uint32_t CR0;                               /**< ERM Configuration Register 0, offset: 0x0 */
  __IO uint32_t CR1;                               /**< ERM Configuration Register 1, offset: 0x4, available only on: ERM_0, ERM_1, ERM_2 (missing on ERM_3, LPE_ERM) */
  __IO uint32_t CR2;                               /**< ERM Configuration Register 2, offset: 0x8, available only on: ERM_1, ERM_2 (missing on ERM_0, ERM_3, LPE_ERM) */
  uint8_t RESERVED_0[4];
  __IO uint32_t SR0;                               /**< ERM Status Register 0, offset: 0x10 */
  __IO uint32_t SR1;                               /**< ERM Status Register 1, offset: 0x14, available only on: ERM_0, ERM_1, ERM_2 (missing on ERM_3, LPE_ERM) */
  __IO uint32_t SR2;                               /**< ERM Status Register 2, offset: 0x18, available only on: ERM_1, ERM_2 (missing on ERM_0, ERM_3, LPE_ERM) */
  uint8_t RESERVED_1[228];
  __I  uint32_t EAR0;                              /**< ERM Memory 0 Error Address Register, offset: 0x100, available only on: ERM_0, ERM_3, LPE_ERM (missing on ERM_1, ERM_2) */
  __I  uint32_t SYN0;                              /**< ERM Memory 0 Syndrome Register, offset: 0x104, available only on: ERM_3 (missing on ERM_0, ERM_1, ERM_2, LPE_ERM) */
  __IO uint32_t CORR_ERR_CNT0;                     /**< ERM Memory 0 Correctable Error Count Register, offset: 0x108 */
  uint8_t RESERVED_2[4];
  __I  uint32_t EAR1;                              /**< ERM Memory 1 Error Address Register, offset: 0x110, available only on: ERM_0, ERM_3, LPE_ERM (missing on ERM_1, ERM_2) */
  __I  uint32_t SYN1;                              /**< ERM Memory 1 Syndrome Register, offset: 0x114, available only on: ERM_3 (missing on ERM_0, ERM_1, ERM_2, LPE_ERM) */
  __IO uint32_t CORR_ERR_CNT1;                     /**< ERM Memory 1 Correctable Error Count Register, offset: 0x118 */
  uint8_t RESERVED_3[4];
  __I  uint32_t EAR2;                              /**< ERM Memory 2 Error Address Register, offset: 0x120, available only on: ERM_0, ERM_3, LPE_ERM (missing on ERM_1, ERM_2) */
  __I  uint32_t SYN2;                              /**< ERM Memory 2 Syndrome Register, offset: 0x124, available only on: ERM_3, LPE_ERM (missing on ERM_0, ERM_1, ERM_2) */
  __IO uint32_t CORR_ERR_CNT2;                     /**< ERM Memory 2 Correctable Error Count Register, offset: 0x128 */
  uint8_t RESERVED_4[4];
  __I  uint32_t EAR3;                              /**< ERM Memory 3 Error Address Register, offset: 0x130, available only on: ERM_0, ERM_3 (missing on ERM_1, ERM_2, LPE_ERM) */
  __I  uint32_t SYN3;                              /**< ERM Memory 3 Syndrome Register, offset: 0x134, available only on: ERM_3 (missing on ERM_0, ERM_1, ERM_2, LPE_ERM) */
  __IO uint32_t CORR_ERR_CNT3;                     /**< ERM Memory 3 Correctable Error Count Register, offset: 0x138 */
  uint8_t RESERVED_5[4];
  __I  uint32_t EAR4;                              /**< ERM Memory 4 Error Address Register, offset: 0x140, available only on: ERM_0, ERM_3 (missing on ERM_1, ERM_2, LPE_ERM) */
  __I  uint32_t SYN4;                              /**< ERM Memory 4 Syndrome Register, offset: 0x144, available only on: ERM_3 (missing on ERM_0, ERM_1, ERM_2, LPE_ERM) */
  __IO uint32_t CORR_ERR_CNT4;                     /**< ERM Memory 4 Correctable Error Count Register, offset: 0x148 */
  uint8_t RESERVED_6[4];
  __I  uint32_t EAR5;                              /**< ERM Memory 5 Error Address Register, offset: 0x150, available only on: ERM_0, ERM_3 (missing on ERM_1, ERM_2, LPE_ERM) */
  __I  uint32_t SYN5;                              /**< ERM Memory 5 Syndrome Register, offset: 0x154, available only on: ERM_3 (missing on ERM_0, ERM_1, ERM_2, LPE_ERM) */
  __IO uint32_t CORR_ERR_CNT5;                     /**< ERM Memory 5 Correctable Error Count Register, offset: 0x158, available only on: ERM_0, ERM_1, ERM_2, ERM_3 (missing on LPE_ERM) */
  uint8_t RESERVED_7[4];
  __I  uint32_t EAR6;                              /**< ERM Memory 6 Error Address Register, offset: 0x160, available only on: ERM_0 (missing on ERM_1, ERM_2, ERM_3, LPE_ERM) */
  uint8_t RESERVED_8[4];
  __IO uint32_t CORR_ERR_CNT6;                     /**< ERM Memory 6 Correctable Error Count Register, offset: 0x168, available only on: ERM_0, ERM_1, ERM_2 (missing on ERM_3, LPE_ERM) */
  uint8_t RESERVED_9[4];
  __I  uint32_t EAR7;                              /**< ERM Memory 7 Error Address Register, offset: 0x170, available only on: ERM_0 (missing on ERM_1, ERM_2, ERM_3, LPE_ERM) */
  uint8_t RESERVED_10[4];
  __IO uint32_t CORR_ERR_CNT7;                     /**< ERM Memory 7 Correctable Error Count Register, offset: 0x178, available only on: ERM_0, ERM_1, ERM_2 (missing on ERM_3, LPE_ERM) */
  uint8_t RESERVED_11[12];
  __IO uint32_t CORR_ERR_CNT8;                     /**< ERM Memory 8 Correctable Error Count Register, offset: 0x188, available only on: ERM_0, ERM_1, ERM_2 (missing on ERM_3, LPE_ERM) */
  uint8_t RESERVED_12[12];
  __IO uint32_t CORR_ERR_CNT9;                     /**< ERM Memory 9 Correctable Error Count Register, offset: 0x198, available only on: ERM_0, ERM_1, ERM_2 (missing on ERM_3, LPE_ERM) */
  uint8_t RESERVED_13[12];
  __IO uint32_t CORR_ERR_CNT10;                    /**< ERM Memory 10 Correctable Error Count Register, offset: 0x1A8, available only on: ERM_0, ERM_1, ERM_2 (missing on ERM_3, LPE_ERM) */
  uint8_t RESERVED_14[12];
  __IO uint32_t CORR_ERR_CNT11;                    /**< ERM Memory 11 Correctable Error Count Register, offset: 0x1B8, available only on: ERM_0, ERM_1, ERM_2 (missing on ERM_3, LPE_ERM) */
  uint8_t RESERVED_15[12];
  __IO uint32_t CORR_ERR_CNT12;                    /**< ERM Memory 12 Correctable Error Count Register, offset: 0x1C8, available only on: ERM_0, ERM_1, ERM_2 (missing on ERM_3, LPE_ERM) */
  uint8_t RESERVED_16[12];
  __IO uint32_t CORR_ERR_CNT13;                    /**< ERM Memory 13 Correctable Error Count Register, offset: 0x1D8, available only on: ERM_0, ERM_1, ERM_2 (missing on ERM_3, LPE_ERM) */
  uint8_t RESERVED_17[12];
  __IO uint32_t CORR_ERR_CNT14;                    /**< ERM Memory 14 Correctable Error Count Register, offset: 0x1E8, available only on: ERM_1, ERM_2 (missing on ERM_0, ERM_3, LPE_ERM) */
  uint8_t RESERVED_18[12];
  __IO uint32_t CORR_ERR_CNT15;                    /**< ERM Memory 15 Correctable Error Count Register, offset: 0x1F8, available only on: ERM_1, ERM_2 (missing on ERM_0, ERM_3, LPE_ERM) */
  uint8_t RESERVED_19[4];
  __I  uint32_t EAR16;                             /**< ERM Memory 16 Error Address Register, offset: 0x200, available only on: ERM_2 (missing on ERM_0, ERM_1, ERM_3, LPE_ERM) */
  __I  uint32_t SYN16;                             /**< ERM Memory 16 Syndrome Register, offset: 0x204, available only on: ERM_2 (missing on ERM_0, ERM_1, ERM_3, LPE_ERM) */
  __IO uint32_t CORR_ERR_CNT16;                    /**< ERM Memory 16 Correctable Error Count Register, offset: 0x208, available only on: ERM_1, ERM_2 (missing on ERM_0, ERM_3, LPE_ERM) */
  uint8_t RESERVED_20[4];
  __I  uint32_t EAR17;                             /**< ERM Memory 17 Error Address Register, offset: 0x210, available only on: ERM_2 (missing on ERM_0, ERM_1, ERM_3, LPE_ERM) */
  __I  uint32_t SYN17;                             /**< ERM Memory 17 Syndrome Register, offset: 0x214, available only on: ERM_2 (missing on ERM_0, ERM_1, ERM_3, LPE_ERM) */
  __IO uint32_t CORR_ERR_CNT17;                    /**< ERM Memory 17 Correctable Error Count Register, offset: 0x218, available only on: ERM_2 (missing on ERM_0, ERM_1, ERM_3, LPE_ERM) */
  uint8_t RESERVED_21[4];
  __I  uint32_t EAR18;                             /**< ERM Memory 18 Error Address Register, offset: 0x220, available only on: ERM_2 (missing on ERM_0, ERM_1, ERM_3, LPE_ERM) */
  __I  uint32_t SYN18;                             /**< ERM Memory 18 Syndrome Register, offset: 0x224, available only on: ERM_2 (missing on ERM_0, ERM_1, ERM_3, LPE_ERM) */
  __IO uint32_t CORR_ERR_CNT18;                    /**< ERM Memory 18 Correctable Error Count Register, offset: 0x228, available only on: ERM_2 (missing on ERM_0, ERM_1, ERM_3, LPE_ERM) */
  uint8_t RESERVED_22[4];
  __I  uint32_t EAR19;                             /**< ERM Memory 19 Error Address Register, offset: 0x230, available only on: ERM_2 (missing on ERM_0, ERM_1, ERM_3, LPE_ERM) */
  __I  uint32_t SYN19;                             /**< ERM Memory 19 Syndrome Register, offset: 0x234, available only on: ERM_2 (missing on ERM_0, ERM_1, ERM_3, LPE_ERM) */
  __IO uint32_t CORR_ERR_CNT19;                    /**< ERM Memory 19 Correctable Error Count Register, offset: 0x238, available only on: ERM_2 (missing on ERM_0, ERM_1, ERM_3, LPE_ERM) */
  uint8_t RESERVED_23[4];
  __I  uint32_t EAR20;                             /**< ERM Memory 20 Error Address Register, offset: 0x240, available only on: ERM_2 (missing on ERM_0, ERM_1, ERM_3, LPE_ERM) */
  __I  uint32_t SYN20;                             /**< ERM Memory 20 Syndrome Register, offset: 0x244, available only on: ERM_2 (missing on ERM_0, ERM_1, ERM_3, LPE_ERM) */
  __IO uint32_t CORR_ERR_CNT20;                    /**< ERM Memory 20 Correctable Error Count Register, offset: 0x248, available only on: ERM_2 (missing on ERM_0, ERM_1, ERM_3, LPE_ERM) */
  uint8_t RESERVED_24[4];
  __I  uint32_t EAR21;                             /**< ERM Memory 21 Error Address Register, offset: 0x250, available only on: ERM_2 (missing on ERM_0, ERM_1, ERM_3, LPE_ERM) */
  __I  uint32_t SYN21;                             /**< ERM Memory 21 Syndrome Register, offset: 0x254, available only on: ERM_2 (missing on ERM_0, ERM_1, ERM_3, LPE_ERM) */
  __IO uint32_t CORR_ERR_CNT21;                    /**< ERM Memory 21 Correctable Error Count Register, offset: 0x258, available only on: ERM_2 (missing on ERM_0, ERM_1, ERM_3, LPE_ERM) */
} ERM_Type, *ERM_MemMapPtr;

/** Number of instances of the ERM module. */
#define ERM_INSTANCE_COUNT                       (5u)

/* ERM - Peripheral instance base addresses */
/** Peripheral ERM_0 base address */
#define IP_ERM_0_BASE                            (0x404D0000u)
/** Peripheral ERM_0 base pointer */
#define IP_ERM_0                                 ((ERM_Type *)IP_ERM_0_BASE)
/** Peripheral ERM_1 base address */
#define IP_ERM_1_BASE                            (0x404DC000u)
/** Peripheral ERM_1 base pointer */
#define IP_ERM_1                                 ((ERM_Type *)IP_ERM_1_BASE)
/** Peripheral ERM_2 base address */
#define IP_ERM_2_BASE                            (0x40B50000u)
/** Peripheral ERM_2 base pointer */
#define IP_ERM_2                                 ((ERM_Type *)IP_ERM_2_BASE)
/** Peripheral ERM_3 base address */
#define IP_ERM_3_BASE                            (0x40B60000u)
/** Peripheral ERM_3 base pointer */
#define IP_ERM_3                                 ((ERM_Type *)IP_ERM_3_BASE)
/** Peripheral LPE_ERM base address */
#define IP_LPE_ERM_BASE                          (0x42130000u)
/** Peripheral LPE_ERM base pointer */
#define IP_LPE_ERM                               ((ERM_Type *)IP_LPE_ERM_BASE)
/** Array initializer of ERM peripheral base addresses */
#define IP_ERM_BASE_ADDRS                        { IP_ERM_0_BASE, IP_ERM_1_BASE, IP_ERM_2_BASE, IP_ERM_3_BASE, IP_LPE_ERM_BASE }
/** Array initializer of ERM peripheral base pointers */
#define IP_ERM_BASE_PTRS                         { IP_ERM_0, IP_ERM_1, IP_ERM_2, IP_ERM_3, IP_LPE_ERM }

/* ----------------------------------------------------------------------------
   -- ERM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ERM_Register_Masks ERM Register Masks
 * @{
 */

/*! @name CR0 - ERM Configuration Register 0 */
/*! @{ */

