zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ERM.h
#define ERM_CORR_ERR_CNT16_COUNT_MASK            (0xFFU)
#define ERM_CORR_ERR_CNT16_COUNT_SHIFT           (0U)
#define ERM_CORR_ERR_CNT16_COUNT_WIDTH           (8U)
#define ERM_CORR_ERR_CNT16_COUNT(x)              (((uint32_t)(((uint32_t)(x)) << ERM_CORR_ERR_CNT16_COUNT_SHIFT)) & ERM_CORR_ERR_CNT16_COUNT_MASK)
/*! @} */

/*! @name EAR17 - ERM Memory 17 Error Address Register */
/*! @{ */

#define ERM_EAR17_EAR_MASK                       (0xFFFFFFFFU)
#define ERM_EAR17_EAR_SHIFT                      (0U)
#define ERM_EAR17_EAR_WIDTH                      (32U)
#define ERM_EAR17_EAR(x)                         (((uint32_t)(((uint32_t)(x)) << ERM_EAR17_EAR_SHIFT)) & ERM_EAR17_EAR_MASK)
/*! @} */

/*! @name SYN17 - ERM Memory 17 Syndrome Register */
/*! @{ */

#define ERM_SYN17_SYNDROME_MASK                  (0xFF000000U)
#define ERM_SYN17_SYNDROME_SHIFT                 (24U)
#define ERM_SYN17_SYNDROME_WIDTH                 (8U)
#define ERM_SYN17_SYNDROME(x)                    (((uint32_t)(((uint32_t)(x)) << ERM_SYN17_SYNDROME_SHIFT)) & ERM_SYN17_SYNDROME_MASK)
/*! @} */

/*! @name CORR_ERR_CNT17 - ERM Memory 17 Correctable Error Count Register */
/*! @{ */

#define ERM_CORR_ERR_CNT17_COUNT_MASK            (0xFFU)
#define ERM_CORR_ERR_CNT17_COUNT_SHIFT           (0U)
#define ERM_CORR_ERR_CNT17_COUNT_WIDTH           (8U)
#define ERM_CORR_ERR_CNT17_COUNT(x)              (((uint32_t)(((uint32_t)(x)) << ERM_CORR_ERR_CNT17_COUNT_SHIFT)) & ERM_CORR_ERR_CNT17_COUNT_MASK)
/*! @} */

/*! @name EAR18 - ERM Memory 18 Error Address Register */
/*! @{ */

#define ERM_EAR18_EAR_MASK                       (0xFFFFFFFFU)
#define ERM_EAR18_EAR_SHIFT                      (0U)
#define ERM_EAR18_EAR_WIDTH                      (32U)
#define ERM_EAR18_EAR(x)                         (((uint32_t)(((uint32_t)(x)) << ERM_EAR18_EAR_SHIFT)) & ERM_EAR18_EAR_MASK)
/*! @} */

/*! @name SYN18 - ERM Memory 18 Syndrome Register */
/*! @{ */

#define ERM_SYN18_SYNDROME_MASK                  (0xFF000000U)
#define ERM_SYN18_SYNDROME_SHIFT                 (24U)
#define ERM_SYN18_SYNDROME_WIDTH                 (8U)
#define ERM_SYN18_SYNDROME(x)                    (((uint32_t)(((uint32_t)(x)) << ERM_SYN18_SYNDROME_SHIFT)) & ERM_SYN18_SYNDROME_MASK)
/*! @} */

/*! @name CORR_ERR_CNT18 - ERM Memory 18 Correctable Error Count Register */
/*! @{ */

#define ERM_CORR_ERR_CNT18_COUNT_MASK            (0xFFU)
#define ERM_CORR_ERR_CNT18_COUNT_SHIFT           (0U)
#define ERM_CORR_ERR_CNT18_COUNT_WIDTH           (8U)
#define ERM_CORR_ERR_CNT18_COUNT(x)              (((uint32_t)(((uint32_t)(x)) << ERM_CORR_ERR_CNT18_COUNT_SHIFT)) & ERM_CORR_ERR_CNT18_COUNT_MASK)
/*! @} */

/*! @name EAR19 - ERM Memory 19 Error Address Register */
/*! @{ */

#define ERM_EAR19_EAR_MASK                       (0xFFFFFFFFU)
#define ERM_EAR19_EAR_SHIFT                      (0U)
#define ERM_EAR19_EAR_WIDTH                      (32U)
#define ERM_EAR19_EAR(x)                         (((uint32_t)(((uint32_t)(x)) << ERM_EAR19_EAR_SHIFT)) & ERM_EAR19_EAR_MASK)
/*! @} */

/*! @name SYN19 - ERM Memory 19 Syndrome Register */
/*! @{ */

#define ERM_SYN19_SYNDROME_MASK                  (0xFF000000U)
#define ERM_SYN19_SYNDROME_SHIFT                 (24U)
#define ERM_SYN19_SYNDROME_WIDTH                 (8U)
#define ERM_SYN19_SYNDROME(x)                    (((uint32_t)(((uint32_t)(x)) << ERM_SYN19_SYNDROME_SHIFT)) & ERM_SYN19_SYNDROME_MASK)
/*! @} */

/*! @name CORR_ERR_CNT19 - ERM Memory 19 Correctable Error Count Register */
/*! @{ */

#define ERM_CORR_ERR_CNT19_COUNT_MASK            (0xFFU)
#define ERM_CORR_ERR_CNT19_COUNT_SHIFT           (0U)
#define ERM_CORR_ERR_CNT19_COUNT_WIDTH           (8U)
#define ERM_CORR_ERR_CNT19_COUNT(x)              (((uint32_t)(((uint32_t)(x)) << ERM_CORR_ERR_CNT19_COUNT_SHIFT)) & ERM_CORR_ERR_CNT19_COUNT_MASK)
/*! @} */

/*! @name EAR20 - ERM Memory 20 Error Address Register */
/*! @{ */

#define ERM_EAR20_EAR_MASK                       (0xFFFFFFFFU)
#define ERM_EAR20_EAR_SHIFT                      (0U)
#define ERM_EAR20_EAR_WIDTH                      (32U)
#define ERM_EAR20_EAR(x)                         (((uint32_t)(((uint32_t)(x)) << ERM_EAR20_EAR_SHIFT)) & ERM_EAR20_EAR_MASK)
/*! @} */

/*! @name SYN20 - ERM Memory 20 Syndrome Register */
/*! @{ */

#define ERM_SYN20_SYNDROME_MASK                  (0xFF000000U)
#define ERM_SYN20_SYNDROME_SHIFT                 (24U)
#define ERM_SYN20_SYNDROME_WIDTH                 (8U)
#define ERM_SYN20_SYNDROME(x)                    (((uint32_t)(((uint32_t)(x)) << ERM_SYN20_SYNDROME_SHIFT)) & ERM_SYN20_SYNDROME_MASK)
/*! @} */

/*! @name CORR_ERR_CNT20 - ERM Memory 20 Correctable Error Count Register */
/*! @{ */

#define ERM_CORR_ERR_CNT20_COUNT_MASK            (0xFFU)
#define ERM_CORR_ERR_CNT20_COUNT_SHIFT           (0U)
#define ERM_CORR_ERR_CNT20_COUNT_WIDTH           (8U)
#define ERM_CORR_ERR_CNT20_COUNT(x)              (((uint32_t)(((uint32_t)(x)) << ERM_CORR_ERR_CNT20_COUNT_SHIFT)) & ERM_CORR_ERR_CNT20_COUNT_MASK)
/*! @} */

/*! @name EAR21 - ERM Memory 21 Error Address Register */
/*! @{ */

#define ERM_EAR21_EAR_MASK                       (0xFFFFFFFFU)
#define ERM_EAR21_EAR_SHIFT                      (0U)
#define ERM_EAR21_EAR_WIDTH                      (32U)
#define ERM_EAR21_EAR(x)                         (((uint32_t)(((uint32_t)(x)) << ERM_EAR21_EAR_SHIFT)) & ERM_EAR21_EAR_MASK)
/*! @} */

/*! @name SYN21 - ERM Memory 21 Syndrome Register */
/*! @{ */

#define ERM_SYN21_SYNDROME_MASK                  (0xFF000000U)
#define ERM_SYN21_SYNDROME_SHIFT                 (24U)
#define ERM_SYN21_SYNDROME_WIDTH                 (8U)
#define ERM_SYN21_SYNDROME(x)                    (((uint32_t)(((uint32_t)(x)) << ERM_SYN21_SYNDROME_SHIFT)) & ERM_SYN21_SYNDROME_MASK)
/*! @} */

/*! @name CORR_ERR_CNT21 - ERM Memory 21 Correctable Error Count Register */
/*! @{ */

#define ERM_CORR_ERR_CNT21_COUNT_MASK            (0xFFU)
#define ERM_CORR_ERR_CNT21_COUNT_SHIFT           (0U)
#define ERM_CORR_ERR_CNT21_COUNT_WIDTH           (8U)
#define ERM_CORR_ERR_CNT21_COUNT(x)              (((uint32_t)(((uint32_t)(x)) << ERM_CORR_ERR_CNT21_COUNT_SHIFT)) & ERM_CORR_ERR_CNT21_COUNT_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group ERM_Register_Masks */

/*!
 * @}
 */ /* end of group ERM_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_ERM_H_) */
